# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv3 object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/yolov3

# Parameters
nc: 6 # number of classes
depth_multiple: 1.0 # model depth multiple
width_multiple: 1.0 # layer channel multiple

# darknet53 backbone
# darknet53 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [16, 3, 1]],  # 0
   [-1, 1, nn.MaxPool2d, [3, 2, 1]],
   [-1, 1, EFE, [32, 1, 1]],
   [-1, 1, nn.MaxPool2d, [3, 2, 1]],
   [-1, 1, EFE, [64, 1, 1]],
   [-1, 1, EFE, [64, 1, 1]],
   [-1, 1, nn.MaxPool2d, [3, 2, 1]],
   [-1, 1, EFE, [128, 1, 1]],
   [-1, 1, EFE, [128, 1, 1]],
   [-1, 1, EFE, [128, 1, 1]],
   [-1, 1, EFE, [128, 1, 1]], # 10
   [-1, 1, nn.MaxPool2d, [3, 2, 1]],
   [-1, 1, EFE, [256, 1, 1]],
   [-1, 1, EFE, [256, 1, 1]],
   [-1, 1, EFE, [256, 1, 1]],
   [-1, 1, EFE, [256, 1, 1]], # 15
   [-1, 1, nn.MaxPool2d, [3, 2, 1]],
   [-1, 1, EFE, [512, 1, 1]],
   [-1, 1, EFE, [512, 1, 1]], # 18
  ]

# YOLOv3-SPP head
head:
  [[-1, 1, RMF, [3072]],
   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, GhostModule, [1024]],
   [-1, 1, Conv, [256, 1, 1]], # 22 (P5/32-large)

   [-4, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 15], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, GhostModule, [512]],
   [-1, 1, Conv, [256, 1, 1]], # 28 (P4/16-medium)

   [-4, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 10], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, GhostModule, [256]],
   [-1, 1, Conv, [256, 1, 1]], # 34 (P3/8-small)
   [[34, 28, 22], 1, Detect, [nc]],   # Detect(P3, P4, P5)
  ]

