# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv5 object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/yolov5

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov5n.yaml' will call yolov5.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.33, 1.25, 1024]

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [64, 6, 2, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, Res2block, [128]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 3, Res2block, [256]] #4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 9, Res2block, [512]] #6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, Res2block, [1024]]
  - [-1, 1, SPP, [1024, [5, 9, 13]]] #9

# YOLOv5 v6.0 head
head:
  - [-1, 1, Conv, [512, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #11
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 1, C3, [512, False]] # 13

  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #15
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 1, C3, [256, False]] # 17 (P3/8-small)
  - [-1, 1, SPP,[256, [5, 9, 13]]] #18

  - [17, 1, Conv, [256, 3, 2]] #19
  - [[-1, 14], 1, Concat, [1]] # cat head P4
  - [-1, 1, C3, [512, False]] # 21 (P4/16-medium)
  - [-1, 1, SPP,[512, [5, 9, 13]]] #22

  - [21, 1, Conv, [512, 3, 2]] #23
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 1, C3, [1024, False]] # 25 (P5/32-large)
  - [-1, 1, SPP,[1024, [5, 9, 13]]] #26

  - [26, 1, Conv, [512, 1, 1]] #27
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #28
  - [[-1, 22], 1, Concat, [1]] #29
  - [-1, 1, C3, [512, False]] #30

  - [-1, 1, Conv, [256, 1, 1]] #31
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #32
  - [[-1, 18], 1, Concat, [1]] #33
  - [-1, 1, C3, [512, False]] #34

  - [-1, 1, Conv, [512, 3, 2]] #35
  - [[-1, 22], 1, Concat, [1]] #36
  - [-1, 1, C3, [512, False]] #37

  - [-1, 1, Conv, [1024, 3, 2]] #38
  - [[-1, 26], 1, Concat, [1]] #39
  - [-1, 1, C3, [1024, False]] #40


  - [[34, 37, 40], 1, Detect, [nc]] # Detect(P3, P4, P5)
